Revit 2024 API
FabricationPart.GetRodInfo Method
 Gets the fabrication rod information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public FabricationRodInfo GetRodInfo()
Visual Basic
Public Function GetRodInfo As FabricationRodInfo
Visual C++
public:
FabricationRodInfo^ GetRodInfo()
Return Value
 The fabrication rod information. Returns null if the fabrication part does not have any rod.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace